# 2. 파이썬 기초

#### 실습문제 1. 현재 시간과 분을 입력값으로 받아서 두개의 값을 더하는 연산을 수행하시오

In [17]:
hour = input()
minutes = input()

10
20

In [20]:
print(int(hour)+int(minutes))

30

#### 실습문제 2. "SEC 20180212 250" 문자열 생성 후 stock_name, date, value로 각각 의미하는 문자열을 생성하시오

In [28]:
List_A = "SEC 20180212 250"

In [32]:
stock_name = List_A[0:3]

In [33]:
stock_name

'SEC'

In [36]:
date = List_A[4:12]

In [37]:
date

'20180212'

In [40]:
value = List_A[13:]

In [41]:
value

'250'

In [44]:
spliter = " "

In [51]:
splitWithSpace = List_A.split(spliter)

In [52]:
splitWithSpace

['SEC', '20180212', '250']

#### 실습문제 3. "Sec 2018W28 250" 문자열 생성 후 stock_name, date, value로 각각 의미하는 문자열을 생성하세요

#### (단, 모두 대문자여야 하며, 'W'를 삭제해야함)

In [55]:
List_B = "Sec 2018W28 250"

In [60]:
stock_name = List_B[0:3].upper()

In [61]:
stock_name

'SEC'

In [66]:
checkChar = List_B.index("W")

In [67]:
date = List_B[4:checkChar]+List_B[checkChar+1:11]

In [68]:
date

'201828'

In [71]:
value = List_B[12:]

In [72]:
value

'250'

#### 실습문제 4. [120,150,300,500,1000,100,2000] 값에서 최소 최대 값을 뺀 평균을 average 이름의 변수에 담으시오

In [75]:
List_C = [120,150,300,500,1000,100,2000]

In [76]:
minValue = min(List_C)

In [77]:
minValue

100

In [78]:
maxValue = max(List_C)

In [79]:
maxValue

2000

In [82]:
List_C.remove(minValue)
List_C.remove(maxValue)

In [83]:
List_C

[120, 150, 300, 500, 1000]

In [84]:
sumValue = sum(List_C)

In [85]:
sumValue

2070

In [86]:
average = sumValue/len(List_C)

In [87]:
average

414.0

#### 실습문제 5. dic = {"name":"sec", "id":"300000","address":"suwon"} 에서 "id":"300000"을 삭제하여 출력하세요

In [91]:
dic = {"name":"sec", "id":"300000","address":"suwon"}

In [92]:
del dic["id"]

In [93]:
dic

{'name': 'sec', 'address': 'suwon'}

#### 실습문제 6. 자신만의 데이터프레임을 생성해보세요

In [2]:
import pandas as pd

In [9]:
data1 = [1,2,3,4,5,6]

In [10]:
data2 = ["a","b","c","d","e"]

In [11]:
data3 = ["apple","box","cat","dry","egg"]

In [20]:
data_DataFrame = pd.DataFrame(data1, columns = ['numbers'])
data_DataFrame2 = pd.DataFrame(data2, columns = ['numbers'])
data_DataFrame3 = pd.DataFrame(data3, columns = ['numbers'])

In [21]:
frame = pd.concat([data_DataFrame2,data_DataFrame3,data_DataFrame], axis = 0)
frame

  numbers
0       a
1       b
2       c
3       d
4       e
0   apple
1     box
2     cat
3     dry
4     egg
0       1
1       2
2       3
3       4
4       5
5       6

#### 실습문제 7. MySQL DB에 접속하여 저장된 데이터를 조회한 후 컬럼의 이름을 REGIONID -> SALESID로 변경 후 저장하세요

In [1]:
import pymysql
from sqlalchemy import create_engine

In [3]:
engine = create_engine('mysql+pymysql://kopo:kopo@13.209.112.251:3306/kopo')

In [4]:
selloutData = pd.read_sql_query('SELECT*FROM kopo_product_volume', engine)

In [6]:
selloutData.head()

  regionid productgroup yearweek    volume
0      A01       ST0002   201512  151750.0
1      A01       ST0001   201520  645626.0
2      A01       ST0002   201520  125863.0
3      A01       ST0001   201515  810144.0
4      A01       ST0002   201515  128999.0

In [7]:
selloutData.columns = ['REGIONID', 'PRODUCTGROUP','YEARWEEK','VOLUME']

In [12]:
selloutData.head()

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME
0      A01       ST0002   201512  151750.0
1      A01       ST0001   201520  645626.0
2      A01       ST0002   201520  125863.0
3      A01       ST0001   201515  810144.0
4      A01       ST0002   201515  128999.0

In [13]:
selloutData2 = selloutData.rename(columns = {'REGIONID': 'SALESID'})

In [14]:
selloutData2.head()

  SALESID PRODUCTGROUP YEARWEEK    VOLUME
0     A01       ST0002   201512  151750.0
1     A01       ST0001   201520  645626.0
2     A01       ST0002   201520  125863.0
3     A01       ST0001   201515  810144.0
4     A01       ST0002   201515  128999.0

#### 실습문제 8